/*
 * PID.c
 *
 *  Created on: 2022年4月24日
 *      Author: 摸鱼
 */
#include "PID.h"

//动态零点PID
//PID_float dyn_ero_PID=
//{
//        0,//误差
//        0,//上一次误差
//        0,0,0,//P I D
//        0,//积分值
//        0,//积分限幅
//        0,//误差之差
//        0//输出
//};
//电磁循迹PID
float track_fenduan[2][3]={{2.6,3.4,-3.4},{0,0,0}};
PID_float electr_track_PID=
{
        0,//误差
        0,//上一0次误差
        2.6,0,0,//P I D
        0,//积分值
        0,//积分限幅
        0,//误差之差
        0//输出
};

//舵机平衡环
PID_float steering_PID=
{
        0,//误差
        0,//上一次误差
        0,0,0,//P I D
        0,//积分值
        1500,//积分限幅
        0,//误差之差
        0//输出
};
//角速度环
PID_float angular_PID=
{
        0,//误差
        0,//上次误差
        5.351,0.3078,0.006,//P I D 6.2,0.15,0 , //5.351,0.3078,0.006,
        0,//积分值
        4000,//积分限幅
        0,//误差之差
        0//输出
};
//角度环
PID_float angle_PID=
{
        0,//误差
        0,//上一次误差
        0.1242,0 ,0.00004,//P I D 0.1242,0 ,0.00004
        0,//积分值
        0,//积分限幅
        0,//误差之差
        0//输出
};
//速度环
PID_float momentum_PID=
{
        0,//误差
        0,//上一次误差
        0.0527,0.000004,0,//P I D  0.0527,0.000004,0,
        0,//积分值
        1000,//积分限幅
        0,//误差之差
        0//输出
};
//电磁循迹PID环


